
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       1 |          9 |           1 |
## Affected resources by action

|  Action  | Resources                                                                                     |
|:--------:|:----------------------------------------------------------------------------------------------|
|    🟡     | `module.vpn.module.openvpn-portal.aws_ecs_capacity_provider.ecs`                              |
|    🟡     | `module.vpn.module.openvpn-portal.aws_ecs_cluster.ecs`                                        |
|    🟡     | `module.vpn.module.openvpn-portal.aws_ecs_service.ecs`                                        |
|    🟡     | `module.vpn.module.openvpn-portal.aws_iam_role.ecs_task_execution_role`                       |
|    🟡     | `module.vpn.module.openvpn-portal.aws_security_group.backend_extra`                           |
|    🟡     | `module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_reserved` |
|    🟡     | `module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_user`     |
|    🟡     | `module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website`                   |
|    🟡     | `module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website`                     |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vpn.module.openvpn-portal.aws_ecs_capacity_provider.ecs will be updated in-place
  ~ resource "aws_ecs_capacity_provider" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:capacity-provider/openvpn-portal"
        name     = "openvpn-portal"
      ~ tags     = {
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.1.1" -> "3.2.0"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.1.1" -> "3.2.0"
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_cluster.ecs will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:cluster/openvpn-portal"
        name     = "openvpn-portal"
      ~ tags     = {
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.1.1" -> "3.2.0"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.1.1" -> "3.2.0"
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/openvpn-portal/openvpn-portal"
        name                               = "openvpn-portal"
      ~ tags                               = {
            "backend_security_group"          = "eyJiYWNrZW5kIjp7ImlkIjoic2ctMGI2MjQ0YjkwOGIzMGE2NmQiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMDg4NGZjYmYxNmViNzA4YTgiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTAyOWE2MGFiM2ZmZWI5YjNlIiwiYmFja2VuZF9zc2hfaW5wdXQiOiJzZ3ItMDY1NWZlYzVjMTU5MTA4MTkiLCJiYWNrZW5kX3NzaF9sb2Nh"
            "created_by_module"               = "infrahouse/ecs/aws"
            "execution_role_arn"              = "arn:aws:iam::493370826424:role/openvpn-portalTaskExecutionRole20240705183912611900000005"
            "instance_role_policy_attachment" = "openvpn-portal-instance-j8szhwpnnnfu20240705183912601000000001-20240705183914452000000010"
            "instance_role_policy_name"       = "openvpn-portal-instance-j8szhwpnnnfu2024070518391381960000000c"
            "load_balancer_arn"               = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/openvp2024070518391751950000001c/539fb530eebce408"
          ~ "module_version"                  = "3.1.1" -> "3.2.0"
            "target_group_arn"                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2024070518391297700000000a/a48a76cdd3cd12a8"
        }
      ~ tags_all                           = {
          ~ "module_version"                  = "3.1.1" -> "3.2.0"
            # (9 unchanged elements hidden)
        }
      ~ task_definition                    = "arn:aws:ecs:us-west-1:493370826424:task-definition/openvpn-portal:3" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_task_definition.ecs must be replaced
-/+ resource "aws_ecs_task_definition" "ecs" {
      ~ arn                      = "arn:aws:ecs:us-west-1:493370826424:task-definition/openvpn-portal:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:493370826424:task-definition/openvpn-portal" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment  = [
                        # (5 unchanged elements hidden)
                        {
                            name  = "OPENVPN_PORT"
                            value = "1194"
                        },
                      + {
                          + name  = "WORKERS"
                          + value = "1"
                        },
                    ]
                  ~ memory       = 400 -> 200
                    name         = "openvpn-portal"
                  ~ portMappings = [
                      ~ {
                          - hostPort      = 0
                          ~ protocol      = "tcp" -> ""
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "openvpn-portal" -> (known after apply)
      + network_mode             = (known after apply)
      - requires_compatibilities = [] -> null
      ~ revision                 = 3 -> (known after apply)
      ~ tags                     = {
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.1.1" -> "3.2.0"
        }
      ~ tags_all                 = {
          ~ "module_version"    = "3.1.1" -> "3.2.0"
            # (3 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "data" -> null
            # (1 unchanged attribute hidden)

          - efs_volume_configuration {
              - file_system_id          = "fs-030af57faac6dc979" -> null
              - root_directory          = "/" -> null
              - transit_encryption_port = 0 -> null
                # (1 unchanged attribute hidden)
            }
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "data"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-030af57faac6dc979"
              + root_directory          = "/"
              + transit_encryption_port = 0
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.vpn.module.openvpn-portal.aws_iam_role.ecs_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "openvpn-portalTaskExecutionRole20240705183912611900000005"
        name                  = "openvpn-portalTaskExecutionRole20240705183912611900000005"
      ~ tags                  = {
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.1.1" -> "3.2.0"
        }
      ~ tags_all              = {
          ~ "module_version"    = "3.1.1" -> "3.2.0"
            # (3 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.aws_security_group.backend_extra will be updated in-place
  ~ resource "aws_security_group" "backend_extra" {
        id                     = "sg-0b6595dd62b412fc4"
        name                   = "openvpn-portal-2024070518391440710000000e"
      ~ tags                   = {
            "Name"              = "ECS openvpn-portal backend"
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.1.1" -> "3.2.0"
        }
      ~ tags_all               = {
          ~ "module_version"    = "3.1.1" -> "3.2.0"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_reserved will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "backend_extra_reserved" {
        id                     = "sgr-04121d07477ccac76"
      ~ tags                   = {
            "Name"              = "ECS reserved"
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.1.1" -> "3.2.0"
        }
      ~ tags_all               = {
          ~ "module_version"    = "3.1.1" -> "3.2.0"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_user will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "backend_extra_user" {
        id                     = "sgr-0ece0a93c49897a2b"
      ~ tags                   = {
            "Name"              = "ECS user traffic"
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.1.1" -> "3.2.0"
        }
      ~ tags_all               = {
          ~ "module_version"    = "3.1.1" -> "3.2.0"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "openvp2024070518391750040000001b"
        name                             = "openvp2024070518391750040000001b"
        # (32 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0ef83181fbf251354"
            name    = "openvp20240705183917137600000019"
          ~ version = "3" -> (known after apply)
        }

      - tag {
          - key                 = "parent_module_version" -> null
          - propagate_at_launch = true -> null
          - value               = "3.1.1" -> null
        }
      + tag {
          + key                 = "parent_module_version"
          + propagate_at_launch = true
          + value               = "3.2.0"
        }

        # (10 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-0ef83181fbf251354"
      ~ instance_type                        = "t3.small" -> "t3a.nano"
      ~ latest_version                       = 3 -> (known after apply)
        name                                 = "openvp20240705183917137600000019"
        tags                                 = {}
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiB8LQogICAgRUNTX0NMVVNURVI9b3BlbnZwbi1wb3J0YWwKICAgIEVDU19MT0dMRVZFTD1kZWJ1ZwogICAgRUNTX0FMTE9XX09GRkhPU1RfSU5UUk9TUEVDVElPTl9BQ0NFU1M9dHJ1ZQogICJwYXRoIjogIi9ldGMvZWNzL2Vjcy5jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJydW5jbWQiOgotICJmYWxsb2NhdGUgLWwgMTAyNE0gL3N3YXBmaWxlIgotICJjaG1vZCA2MDAgL3N3YXBmaWxlIgotICJta3N3YXAgL3N3YXBmaWxlIgotICJzd2Fwb24gL3N3YXBmaWxlIgoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogfC0KICAgIEVDU19DTFVTVEVSPW9wZW52cG4tcG9ydGFsCiAgICBFQ1NfTE9HTEVWRUw9ZGVidWcKICAgIEVDU19BTExPV19PRkZIT1NUX0lOVFJPU1BFQ1RJT05fQUNDRVNTPXRydWUKICAicGF0aCI6ICIvZXRjL2Vjcy9lY3MuY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg=="
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 9 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEsICJjaGFuZ2UiOiA5LCAiZGVzdHJveSI6IDF9fQ==
```
</details>